---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailFilletCreationError
source: html/e7582f86-f8fa-4e67-59bf-26e41dc78cf9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailFilletCreationError Property

Cannot create specified fillet at rail path corner.

## Syntax (C#)
```csharp
public static FailureDefinitionId ContinuousRailFilletCreationError { get; }
```